{
  "main": {
    "name": "Hillary Kiptoo",
    "occupation": "Fullstack software engineer",
    "description": "Focused, motivated & passionate",
    "image": "profilepic2.png",
    "bio": "I'm Hillary, a Full-Stack engineer and Freelancer with over 3 years of experience. I've actively contributed to the growth and scalability of various applications, collaborating with both start-ups and clients. My journey began as a Political scientist and Onion Farmer, but my fascination with software development ignited during my third year of pursuing a Bachelor's degree. Fueling my passion, I embarked on a transformative path with Microverse, honing my expertise in an array of technologies including React, Redux, HTML, CSS, Javascript, and Ruby on Rails. Through dynamic pair programming and engaging live coding sessions, I've assembled an impressive portfolio showcasing my adeptness in crafting diverse and innovative projects. Furthermore, my commitment to continuous learning led me to explore the realm of Machine Learning, enabling me to incorporate these skills into practical projects within my professional endeavors. ",
    "contactmessage": "Get in touch with me!",
    "email": "hillaryodhiambo282@gmail.com",
    "phone": "+254794746207",
    "address": {
      "street": "Oginga odinga",
      "city": "Nairobi",
      "state": "Kenya",
      "zip": "27"
    },
    "website": "https://www.hillarykiptoo.me",
    "resumedownload": "https://docs.google.com/document/d/1261Jh-Byt4B5gn2wkvQ5Qpv7PiN0cs-zlVhIqmFzIMQ/edit?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/hillarykiptoo/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/imhilla",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My Programming Language Proficiency",
    "education": [
      {
        "school": "Microverse - US",
        "degree": "Web developemnt & Computer Software engineering",
        "graduated": "February 2021",
        "description": " Learnt the fundamentals of FullStack development. These included HTML, CSS, React, Redux, Ruby, Ruby on Rails, JavaScript, React Hooks, GraphQL. Used git workflow and Github. Completed 1600+ development hours pair programming with different students from different countries using agile methodologies. Spent 100+ hours solving complex algorithms and data structures. Attended both morning and evening standup meetings with teams to carry out code reviews and suggest better ways to implement features for a project. Built 30+ projects ranging from simple to complex applications."
      },
      {
        "school": "Rongo University - KENYA",
        "degree": "Bachelor's Degree, Political Science",
        "graduated": "July 2016",
        "description": " Learned how to research political subjects, such as the Kenyan political system and foreign relations. Learned how to collect and analyze data from sources such as public opinion surveys.  Learned how to develop and test political theories. Evaluated the effects of policies and laws on government, businesses, and people. Learned how to monitor current events, policy decisions, and other related issues. Submitted research results by giving presentations and publishing articles."
      }
    ],
    "work": [
      {
        "company": "Powwater",
        "title": "Fullstack engineer",
        "years": "April 2021 - July 2023",
        "description": "Powwater is a mobile technology platform connecting high-quality water vendors with customers in Kenya (and soon to be East Africa & beyond) for a transparent, reliable, and high-quality water purchasing experience. Funded by Boost VC, Goodwater Capital, Blue Collective, and The Bill & Melinda Gates Foundation."
      },
      {
        "company": "Freelancer",
        "title": "Fullstack developer Upwork",
        "years": "May 2019 - Present",
        "description": "I specialize in boosting digital presence for businesses and individuals through expert web and mobile app development. As a skilled full-stack developer, I create robust, scalable solutions for exceptional client results. "
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "90%"
      },
      {
        "name": "Ruby",
        "level": "85%"
      },
      {
        "name": "Rails",
        "level": "85%"
      },
      {
        "name": "Git",
        "level": "80%"
      },
      {
        "name": "JavaScript",
        "level": "90%"
      },
      {
        "name": "Web Development",
        "level": "90%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Positivus",
        "category": "",
        "image": "positivus.jpg",
        "url": "https://positivus-virid.vercel.app/"
      },
      {
        "title": "Texting service",
        "category": "",
        "image": "texting.jpg",
        "url": "https://github.com/imhilla/texting_service"
      },
      {
        "title": "Tictactoe (Vanilla JS)",
        "category": "",
        "image": "tictactoe.PNG",
        "url": "https://raw.githack.com/imhilla/tictactoe/feature/index.html"
      },
      {
        "title": "Slack Clone (React JS)",
        "category": "",
        "image": "slack.PNG",
        "url": "https://slack-20b65.web.app/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I was particularly impressed by Hillary’s ability to handle even the toughest of project challenges—effortlessly. That skill often takes years to develop among software developers, but it seemed to come perfectly naturally to him.",
        "user": "Muhammad Fahad"
      },
      {
        "text": "I studied with Hillary for more than a month. We completed our projects at the expected time. He was a good collaborator. I discussed my idea with him comfortably. More, he was punctual; we started our meetings on time.",
        "user": "Hasan OZOVALI"
      }
    ]
  }
}